clc; clear; close all

% -------------------- داده‌ها --------------------
P1 = 100000; % Pa
T1 = 300;    % K
k = 1.4;
c_v = 718;
q_in1 = 1390723; % J/kg
CR = 14;         % Compression ratio
ER = 17;         % Expansion ratio

% حجم‌ها
V1 = 1;          % حجم مرجع (اختیاری)
V2 = V1 / CR;

% نقاط اصلی دما و فشار
T2 = T1 * CR^(k-1);
P2 = P1 * CR^k;
T3 = T2 + q_in1/c_v;
P3 = P2 * (T3/T2);
T4 = T3 * (1/CR)^(k-1); % انبساط ایزنتروپیک به V1؟
P4 = P3 * (1/CR)^k;
T5 = T3 * (1/ER)^(k-1); % انبساط ایزنتروپیک به V3؟
P5 = P3 * (1/ER)^k;
T6 = T1 * (ER/CR);
P6 = P1 * (ER/CR)^(-k);

% گرمای خروجی و بازده
q_out1 = c_v * (T5 - T6);
etta = (1 - (q_out1/q_in1)) * 100;
fprintf('بازده چرخه آتکینسون = %.2f%%\n', etta);
